; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_2 ?v5 - type_2 ?v7 - type_3)
 	      (pred_1 ?v2 - object ?v7 - type_3)
	      (pred_3 ?v5 - type_2 ?v6 - type_1)
	      (pred_4 ?v5 - type_2 ?v2 - object ?v6 - type_1))

   (:action op_1
       :parameters  (?v5 - type_2 ?v4 ?v8 - type_3)
       :precondition (and  (pred_2 ?v5 ?v4))
       :effect (and  (pred_2 ?v5 ?v8)
		     (not (pred_2 ?v5 ?v4))))

   (:action op_2
       :parameters (?v5 - type_2 ?v3 - object ?v1 - type_3 ?v6 - type_1)
       :precondition  (and  (pred_1 ?v3 ?v1) (pred_2 ?v5 ?v1) (pred_3 ?v5 ?v6))
       :effect (and (pred_4 ?v5 ?v3 ?v6)
		    (not (pred_1 ?v3 ?v1)) 
		    (not (pred_3 ?v5 ?v6))))

   (:action op_3
       :parameters (?v5 - type_2 ?v3 - object ?v1 - type_3 ?v6 - type_1)
       :precondition  (and  (pred_4 ?v5 ?v3 ?v6) (pred_2 ?v5 ?v1))
       :effect (and (pred_1 ?v3 ?v1)
		    (pred_3 ?v5 ?v6)
		    (not (pred_4 ?v5 ?v3 ?v6)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_10 - type_2
obj_02 obj_03 - type_1
obj_04 obj_09 obj_07 obj_01 - type_3
obj_08 obj_06 obj_05 - object)
(:init
(pred_2 obj_10 obj_07)
(pred_3 obj_10 obj_02)
(pred_3 obj_10 obj_03)
(pred_1 obj_08 obj_09)
(pred_1 obj_06 obj_04)
(pred_1 obj_05 obj_01)
)
(:goal
(and
(pred_1 obj_08 obj_07)
(pred_1 obj_06 obj_07)
(pred_1 obj_05 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_10 ?b obj_03))))
)
)

; plan
1. (op_1 obj_10 obj_07 obj_04)
   deleted: (pred_2 obj_10 obj_07)
   added: (pred_2 obj_10 obj_04)
   goals met: 1 of 3
2. (op_2 obj_10 obj_06 obj_04 obj_02)
   deleted: (pred_1 obj_06 obj_04) (pred_3 obj_10 obj_02)
   added: (pred_4 obj_10 obj_06 obj_02)
   goals met: 1 of 3
3. (op_1 obj_10 obj_04 obj_07)
   deleted: (pred_2 obj_10 obj_04)
   added: (pred_2 obj_10 obj_07)
   goals met: 1 of 3
4. (op_3 obj_10 obj_06 obj_07 obj_02)
   deleted: (pred_4 obj_10 obj_06 obj_02)
   added: (pred_1 obj_06 obj_07) (pred_3 obj_10 obj_02)
   goals met: 2 of 3
5. (op_1 obj_10 obj_07 obj_09)
   deleted: (pred_2 obj_10 obj_07)
   added: (pred_2 obj_10 obj_09)
   goals met: 2 of 3
6. (op_2 obj_10 obj_08 obj_09 obj_02)
   deleted: (pred_1 obj_08 obj_09) (pred_3 obj_10 obj_02)
   added: (pred_4 obj_10 obj_08 obj_02)
   goals met: 2 of 3
7. (op_1 obj_10 obj_09 obj_07)
   deleted: (pred_2 obj_10 obj_09)
   added: (pred_2 obj_10 obj_07)
   goals met: 2 of 3
8. (op_3 obj_10 obj_08 obj_07 obj_02)
   deleted: (pred_4 obj_10 obj_08 obj_02)
   added: (pred_1 obj_08 obj_07) (pred_3 obj_10 obj_02)
   goals met: 3 of 3
